Revit 2018 API
FilePath Methods
The FilePath type exposes the following members.
Methods
Name | Description
Compare
 Compares this ModelPath with another
 (Inherited from ModelPath.)
Dispose |  (Inherited from ModelPath.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModelGUID
 A GUID identifying the A360 model.
 (Inherited from ModelPath.)
GetProjectGUID
 A GUID identifying the A360 project to which the model is associated.
 (Inherited from ModelPath.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FilePath Class
Autodesk.Revit.DB Namespace